cask_args appdir: "/Applications"

tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/services"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "getantibody/antibody"
tap "github/gh"
tap "versent/taps"
tap "aws/tap"

brew "antibody"
brew "automake"
brew "aws-iam-authenticator"
brew "awscli"
brew "aws-sam-cli"
brew "bat"
brew "docker-credential-helper-ecr"
brew "diff-so-fancy"
brew "ffmpeg"
brew "gh"
brew "git"
brew "go"
brew "gpg"
brew "gnupg"
brew "grc"
brew "htop"
brew "jq"
brew "mas"
brew "mkcert"
brew "node"
# brew "shellcheck"
brew "telnet"
brew "terraform"
brew "terminal-notifier"
brew "the_silver_searcher"
brew "wget"
brew "zsh"
brew "z"
brew "php"
brew "php@7.4"
brew "tmux"
brew "navi"
brew "gcc"
brew "nvm"
brew "rustup-init"
brew "bison"
brew "re2c"
brew "libiconv"
brew "dive"

# gnu stuff
brew "coreutils"
brew "findutils"
brew "gnu-tar"
brew "gnu-sed"
brew "gawk"
brew "gnutls"
brew "gnu-indent"
brew "gnu-getopt"

cask "font-hack"
cask "font-jetbrains-mono"
cask "google-backup-and-sync"
# cask "google-chrome"
cask "firefox-developer-edition"
cask "alacritty"
# cask "slack"
cask "spotify"
# cask "transmission"
# cask "viscosity"
# cask "vlc"
# cask "zoom"
# cask "plex-media-server"
cask "whatsapp"
cask "obs"
cask "kap"
cask "android-file-transfer"
cask "android-platform-tools"
cask "jetbrains-toolbox"
cask "rectangle"

