cask_args appdir: "/Applications"

tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/services"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "getantibody/antibody"
tap "github/gh"
tap "versent/taps"

brew "antibody"
brew "aws-iam-authenticator"
brew "awscli"
brew "diff-so-fancy"
brew "ffmpeg"
brew "gh"
brew "git"
brew "go"
brew "gpg"
brew "gnupg"
brew "grc"
brew "htop"
brew "jq"
brew "mas"
brew "mkcert"
brew "node"
brew "oath-toolkit"
brew "pinentry-mac"
brew "shellcheck"
brew "telnet"
brew "terraform"
brew "terminal-notifier"
brew "the_silver_searcher"
brew "versent/taps/saml2aws"
brew "wget"
brew "zsh"
brew "z"
brew "php"
brew "php@7.2"
brew "php@7.3"
brew "php@7.4"
brew "svn"
brew "lastpass-cli"
brew "tmux"

# gnu stuff
brew "coreutils"
brew "findutils"
brew "gnu-tar"
brew "gnu-sed"
brew "gawk"
brew "gnutls"
brew "gnu-indent"
brew "gnu-getopt"

cask "docker"
cask "font-hack"
cask "font-jetbrains-mono"
cask "google-backup-and-sync"
cask "google-chrome"
cask "firefox-developer-edition"
cask "phpstorm"
cask "alacritty"
cask "slack"
cask "spotify"
cask "transmission"
cask "viscosity"
cask "vlc"
cask "zoomus"
cask "plex-media-server"
cask "microsoft-teams"
cask "whatsapp"
cask "obs"
cask "kap"
cask "microsoft-outlook"

# https://github.com/sindresorhus/quick-look-plugins
cask "qlcolorcode"
cask "qlimagesize"
cask "qlvideo"
cask "qlmarkdown"
cask "qlprettypatch"
cask "qlstephen"
cask "quicklook-csv"
cask "quicklook-json"
cask "suspicious-package"
cask "webpquicklook"

# MacApp Store Apps
mas install 1091189122
